18-rails-validations/trainshop/app/views/trains/_form.html.erb

  <%= f.label :passenger_ids, 'Select passengers:' %>
  <%= f.collection_check_boxes :passenger_ids, Passenger.all, :id, :name %>
---
SELECT "passengers".* FROM "passengers"