18-rails-validations/trainshop/app/controllers/trains_controller.rb

INSERT INTO "trains" ("name", "price", "created_at", "updated_at", "conductor_id") VALUES (?, ?, ?, ?, ?)  [["name", "the rain train"], ["price", 3], ["created_at", "2019-02-04 11:50:04.404168"], ["updated_at", "2019-02-04 11:50:04.404168"], ["conductor_id", 3]]
---
  def create
    @train = Train.create(train_params)

UPDATE "trains" SET "name" = ?, "conductor_id" = ?, "updated_at" = ? WHERE "trains"."id" = ?  [["name", "Gravy Train666"], ["conductor_id", 5], ["updated_at", "2019-02-05 11:59:20.903894"], ["id", 2]]
---
  def update
    @train.update(train_params)

SELECT  "trains".* FROM "trains" WHERE "trains"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def find_train
    @train = Train.find(params[:id])

SELECT "conductors".* FROM "conductors"
---
  def find_conductors
    @conductors = Conductor.all